Model: "sequential_10"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
conv2d_28 (Conv2D)           (None, 128, 128, 128)     3584      
_________________________________________________________________
batch_normalization_27 (Batc (None, 128, 128, 128)     512       
_________________________________________________________________
max_pooling2d_16 (MaxPooling (None, 64, 64, 128)       0         
_________________________________________________________________
conv2d_29 (Conv2D)           (None, 64, 64, 64)        73792     
_________________________________________________________________
batch_normalization_28 (Batc (None, 64, 64, 64)        256       
_________________________________________________________________
max_pooling2d_17 (MaxPooling (None, 32, 32, 64)        0         
_________________________________________________________________
conv2d_30 (Conv2D)           (None, 32, 32, 32)        18464     
_________________________________________________________________
batch_normalization_29 (Batc (None, 32, 32, 32)        128       
_________________________________________________________________
encoder (MaxPooling2D)       (None, 16, 16, 32)        0         
_________________________________________________________________
flatten_10 (Flatten)         (None, 8192)              0         
_________________________________________________________________
dense_90 (Dense)             (None, 4096)              33558528  
_________________________________________________________________
dense_91 (Dense)             (None, 4096)              16781312  
_________________________________________________________________
dense_92 (Dense)             (None, 2042)              8366074   
_________________________________________________________________
dense_93 (Dense)             (None, 2042)              4171806   
_________________________________________________________________
dense_94 (Dense)             (None, 1024)              2092032   
_________________________________________________________________
dense_95 (Dense)             (None, 1024)              1049600   
_________________________________________________________________
dense_96 (Dense)             (None, 512)               524800    
_________________________________________________________________
dense_97 (Dense)             (None, 512)               262656    
_________________________________________________________________
dense_98 (Dense)             (None, 8)                 4104      
=================================================================
Total params: 66,907,648
Trainable params: 66,907,200
Non-trainable params: 448
_________________________________________________________________